zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/pio/pic32cz2038ca70144.h
#define PIN_PA17A_QSPI_QIO2                        (17L)        /**< QSPI signal: QIO2 on PA17 mux A*/
#define MUX_PA17A_QSPI_QIO2                        (0L)         /**< QSPI signal line function value: QIO2 */
#define PORT_PA17A_QSPI_QIO2                       (1UL << 17)
#define PIN_PD31A_QSPI_QIO3                        (127L)       /**< QSPI signal: QIO3 on PD31 mux A*/
#define MUX_PD31A_QSPI_QIO3                        (0L)         /**< QSPI signal line function value: QIO3 */
#define PORT_PD31A_QSPI_QIO3                       (1UL << 31)
#define PIN_PA14A_QSPI_QSCK                        (14L)        /**< QSPI signal: QSCK on PA14 mux A*/
#define MUX_PA14A_QSPI_QSCK                        (0L)         /**< QSPI signal line function value: QSCK */
#define PORT_PA14A_QSPI_QSCK                       (1UL << 14)
/* ========== PIO definition for RTC peripheral ========== */
#define PIN_PB0X1_RTC_RTCOUT0                      (32L)        /**< RTC signal: RTCOUT0 on PB0 mux X1*/
#define PORT_PB0X1_RTC_RTCOUT0                     (1UL << 0)
#define PIN_PB1X1_RTC_RTCOUT1                      (33L)        /**< RTC signal: RTCOUT1 on PB1 mux X1*/
#define PORT_PB1X1_RTC_RTCOUT1                     (1UL << 1)
/* ========== PIO definition for SPI0 peripheral ========== */
#define PIN_PD20B_SPI0_MISO                        (116L)       /**< SPI0 signal: SPI0_MISO on PD20 mux B*/
#define MUX_PD20B_SPI0_MISO                        (1L)         /**< SPI0 signal line function value: SPI0_MISO */
#define PORT_PD20B_SPI0_MISO                       (1UL << 20)
#define PIN_PD21B_SPI0_MOSI                        (117L)       /**< SPI0 signal: SPI0_MOSI on PD21 mux B*/
#define MUX_PD21B_SPI0_MOSI                        (1L)         /**< SPI0 signal line function value: SPI0_MOSI */
#define PORT_PD21B_SPI0_MOSI                       (1UL << 21)
#define PIN_PB2D_SPI0_NPCS0                        (34L)        /**< SPI0 signal: SPI0_NPCS0 on PB2 mux D*/
#define MUX_PB2D_SPI0_NPCS0                        (3L)         /**< SPI0 signal line function value: SPI0_NPCS0 */
#define PORT_PB2D_SPI0_NPCS0                       (1UL << 2)
#define PIN_PA31A_SPI0_NPCS1                       (31L)        /**< SPI0 signal: SPI0_NPCS1 on PA31 mux A*/
#define MUX_PA31A_SPI0_NPCS1                       (0L)         /**< SPI0 signal line function value: SPI0_NPCS1 */
#define PORT_PA31A_SPI0_NPCS1                      (1UL << 31)
#define PIN_PD25B_SPI0_NPCS1                       (121L)       /**< SPI0 signal: SPI0_NPCS1 on PD25 mux B*/
#define MUX_PD25B_SPI0_NPCS1                       (1L)         /**< SPI0 signal line function value: SPI0_NPCS1 */
#define PORT_PD25B_SPI0_NPCS1                      (1UL << 25)
#define PIN_PD12C_SPI0_NPCS2                       (108L)       /**< SPI0 signal: SPI0_NPCS2 on PD12 mux C*/
#define MUX_PD12C_SPI0_NPCS2                       (2L)         /**< SPI0 signal line function value: SPI0_NPCS2 */
#define PORT_PD12C_SPI0_NPCS2                      (1UL << 12)
#define PIN_PD27B_SPI0_NPCS3                       (123L)       /**< SPI0 signal: SPI0_NPCS3 on PD27 mux B*/
#define MUX_PD27B_SPI0_NPCS3                       (1L)         /**< SPI0 signal line function value: SPI0_NPCS3 */
#define PORT_PD27B_SPI0_NPCS3                      (1UL << 27)
#define PIN_PD22B_SPI0_SPCK                        (118L)       /**< SPI0 signal: SPI0_SPCK on PD22 mux B*/
#define MUX_PD22B_SPI0_SPCK                        (1L)         /**< SPI0 signal line function value: SPI0_SPCK */
#define PORT_PD22B_SPI0_SPCK                       (1UL << 22)
/* ========== PIO definition for SPI1 peripheral ========== */
#define PIN_PC26C_SPI1_MISO                        (90L)        /**< SPI1 signal: SPI1_MISO on PC26 mux C*/
#define MUX_PC26C_SPI1_MISO                        (2L)         /**< SPI1 signal line function value: SPI1_MISO */
#define PORT_PC26C_SPI1_MISO                       (1UL << 26)
#define PIN_PC27C_SPI1_MOSI                        (91L)        /**< SPI1 signal: SPI1_MOSI on PC27 mux C*/
#define MUX_PC27C_SPI1_MOSI                        (2L)         /**< SPI1 signal line function value: SPI1_MOSI */
#define PORT_PC27C_SPI1_MOSI                       (1UL << 27)
#define PIN_PC25C_SPI1_NPCS0                       (89L)        /**< SPI1 signal: SPI1_NPCS0 on PC25 mux C*/
#define MUX_PC25C_SPI1_NPCS0                       (2L)         /**< SPI1 signal line function value: SPI1_NPCS0 */
#define PORT_PC25C_SPI1_NPCS0                      (1UL << 25)
#define PIN_PC28C_SPI1_NPCS1                       (92L)        /**< SPI1 signal: SPI1_NPCS1 on PC28 mux C*/
#define MUX_PC28C_SPI1_NPCS1                       (2L)         /**< SPI1 signal line function value: SPI1_NPCS1 */
#define PORT_PC28C_SPI1_NPCS1                      (1UL << 28)
#define PIN_PD0C_SPI1_NPCS1                        (96L)        /**< SPI1 signal: SPI1_NPCS1 on PD0 mux C*/
#define MUX_PD0C_SPI1_NPCS1                        (2L)         /**< SPI1 signal line function value: SPI1_NPCS1 */
#define PORT_PD0C_SPI1_NPCS1                       (1UL << 0)
#define PIN_PC29C_SPI1_NPCS2                       (93L)        /**< SPI1 signal: SPI1_NPCS2 on PC29 mux C*/
#define MUX_PC29C_SPI1_NPCS2                       (2L)         /**< SPI1 signal line function value: SPI1_NPCS2 */
#define PORT_PC29C_SPI1_NPCS2                      (1UL << 29)
#define PIN_PD1C_SPI1_NPCS2                        (97L)        /**< SPI1 signal: SPI1_NPCS2 on PD1 mux C*/
#define MUX_PD1C_SPI1_NPCS2                        (2L)         /**< SPI1 signal line function value: SPI1_NPCS2 */
#define PORT_PD1C_SPI1_NPCS2                       (1UL << 1)
#define PIN_PC30C_SPI1_NPCS3                       (94L)        /**< SPI1 signal: SPI1_NPCS3 on PC30 mux C*/
#define MUX_PC30C_SPI1_NPCS3                       (2L)         /**< SPI1 signal line function value: SPI1_NPCS3 */
#define PORT_PC30C_SPI1_NPCS3                      (1UL << 30)
#define PIN_PD2C_SPI1_NPCS3                        (98L)        /**< SPI1 signal: SPI1_NPCS3 on PD2 mux C*/
#define MUX_PD2C_SPI1_NPCS3                        (2L)         /**< SPI1 signal line function value: SPI1_NPCS3 */
#define PORT_PD2C_SPI1_NPCS3                       (1UL << 2)
#define PIN_PC24C_SPI1_SPCK                        (88L)        /**< SPI1 signal: SPI1_SPCK on PC24 mux C*/
#define MUX_PC24C_SPI1_SPCK                        (2L)         /**< SPI1 signal line function value: SPI1_SPCK */
#define PORT_PC24C_SPI1_SPCK                       (1UL << 24)
/* ========== PIO definition for SSC peripheral ========== */
#define PIN_PA10C_SSC_RD                           (10L)        /**< SSC signal: RD on PA10 mux C*/
#define MUX_PA10C_SSC_RD                           (2L)         /**< SSC signal line function value: RD */
#define PORT_PA10C_SSC_RD                          (1UL << 10)
#define PIN_PD24B_SSC_RF                           (120L)       /**< SSC signal: RF on PD24 mux B*/
#define MUX_PD24B_SSC_RF                           (1L)         /**< SSC signal line function value: RF */
#define PORT_PD24B_SSC_RF                          (1UL << 24)
#define PIN_PA22A_SSC_RK                           (22L)        /**< SSC signal: RK on PA22 mux A*/
#define MUX_PA22A_SSC_RK                           (0L)         /**< SSC signal line function value: RK */
#define PORT_PA22A_SSC_RK                          (1UL << 22)
#define PIN_PB5D_SSC_TD                            (37L)        /**< SSC signal: TD on PB5 mux D*/
#define MUX_PB5D_SSC_TD                            (3L)         /**< SSC signal line function value: TD */
#define PORT_PB5D_SSC_TD                           (1UL << 5)
#define PIN_PD10C_SSC_TD                           (106L)       /**< SSC signal: TD on PD10 mux C*/
#define MUX_PD10C_SSC_TD                           (2L)         /**< SSC signal line function value: TD */
#define PORT_PD10C_SSC_TD                          (1UL << 10)
#define PIN_PD26B_SSC_TD                           (122L)       /**< SSC signal: TD on PD26 mux B*/
#define MUX_PD26B_SSC_TD                           (1L)         /**< SSC signal line function value: TD */
#define PORT_PD26B_SSC_TD                          (1UL << 26)
#define PIN_PB0D_SSC_TF                            (32L)        /**< SSC signal: TF on PB0 mux D*/
#define MUX_PB0D_SSC_TF                            (3L)         /**< SSC signal line function value: TF */
#define PORT_PB0D_SSC_TF                           (1UL << 0)
#define PIN_PB1D_SSC_TK                            (33L)        /**< SSC signal: TK on PB1 mux D*/
#define MUX_PB1D_SSC_TK                            (3L)         /**< SSC signal line function value: TK */
#define PORT_PB1D_SSC_TK                           (1UL << 1)
/* ========== PIO definition for TC0 peripheral ========== */
#define PIN_PA4B_TC0_TCLK0                         (4L)         /**< TC0 signal: TCLK0 on PA4 mux B*/
#define MUX_PA4B_TC0_TCLK0                         (1L)         /**< TC0 signal line function value: TCLK0 */
#define PORT_PA4B_TC0_TCLK0                        (1UL << 4)
#define PIN_PA28B_TC0_TCLK1                        (28L)        /**< TC0 signal: TCLK1 on PA28 mux B*/
#define MUX_PA28B_TC0_TCLK1                        (1L)         /**< TC0 signal line function value: TCLK1 */
#define PORT_PA28B_TC0_TCLK1                       (1UL << 28)
#define PIN_PA29B_TC0_TCLK2                        (29L)        /**< TC0 signal: TCLK2 on PA29 mux B*/
#define MUX_PA29B_TC0_TCLK2                        (1L)         /**< TC0 signal line function value: TCLK2 */
#define PORT_PA29B_TC0_TCLK2                       (1UL << 29)
#define PIN_PA0B_TC0_TIOA0                         (0L)         /**< TC0 signal: TIOA0 on PA0 mux B*/
#define MUX_PA0B_TC0_TIOA0                         (1L)         /**< TC0 signal line function value: TIOA0 */
#define PORT_PA0B_TC0_TIOA0                        (1UL << 0)
#define PIN_PA15B_TC0_TIOA1                        (15L)        /**< TC0 signal: TIOA1 on PA15 mux B*/
#define MUX_PA15B_TC0_TIOA1                        (1L)         /**< TC0 signal line function value: TIOA1 */
#define PORT_PA15B_TC0_TIOA1                       (1UL << 15)
#define PIN_PA26B_TC0_TIOA2                        (26L)        /**< TC0 signal: TIOA2 on PA26 mux B*/
#define MUX_PA26B_TC0_TIOA2                        (1L)         /**< TC0 signal line function value: TIOA2 */
#define PORT_PA26B_TC0_TIOA2                       (1UL << 26)
#define PIN_PA1B_TC0_TIOB0                         (1L)         /**< TC0 signal: TIOB0 on PA1 mux B*/
#define MUX_PA1B_TC0_TIOB0                         (1L)         /**< TC0 signal line function value: TIOB0 */
#define PORT_PA1B_TC0_TIOB0                        (1UL << 1)
#define PIN_PA16B_TC0_TIOB1                        (16L)        /**< TC0 signal: TIOB1 on PA16 mux B*/
#define MUX_PA16B_TC0_TIOB1                        (1L)         /**< TC0 signal line function value: TIOB1 */
#define PORT_PA16B_TC0_TIOB1                       (1UL << 16)
#define PIN_PA27B_TC0_TIOB2                        (27L)        /**< TC0 signal: TIOB2 on PA27 mux B*/
#define MUX_PA27B_TC0_TIOB2                        (1L)         /**< TC0 signal line function value: TIOB2 */
#define PORT_PA27B_TC0_TIOB2                       (1UL << 27)
/* ========== PIO definition for TC1 peripheral ========== */
#define PIN_PC25B_TC1_TCLK3                        (89L)        /**< TC1 signal: TCLK3 on PC25 mux B*/
#define MUX_PC25B_TC1_TCLK3                        (1L)         /**< TC1 signal line function value: TCLK3 */
#define PORT_PC25B_TC1_TCLK3                       (1UL << 25)
#define PIN_PC28B_TC1_TCLK4                        (92L)        /**< TC1 signal: TCLK4 on PC28 mux B*/
#define MUX_PC28B_TC1_TCLK4                        (1L)         /**< TC1 signal line function value: TCLK4 */
#define PORT_PC28B_TC1_TCLK4                       (1UL << 28)
#define PIN_PC31B_TC1_TCLK5                        (95L)        /**< TC1 signal: TCLK5 on PC31 mux B*/
#define MUX_PC31B_TC1_TCLK5                        (1L)         /**< TC1 signal line function value: TCLK5 */
#define PORT_PC31B_TC1_TCLK5                       (1UL << 31)
#define PIN_PC23B_TC1_TIOA3                        (87L)        /**< TC1 signal: TIOA3 on PC23 mux B*/
#define MUX_PC23B_TC1_TIOA3                        (1L)         /**< TC1 signal line function value: TIOA3 */
#define PORT_PC23B_TC1_TIOA3                       (1UL << 23)
#define PIN_PC26B_TC1_TIOA4                        (90L)        /**< TC1 signal: TIOA4 on PC26 mux B*/
#define MUX_PC26B_TC1_TIOA4                        (1L)         /**< TC1 signal line function value: TIOA4 */
#define PORT_PC26B_TC1_TIOA4                       (1UL << 26)
#define PIN_PC29B_TC1_TIOA5                        (93L)        /**< TC1 signal: TIOA5 on PC29 mux B*/
#define MUX_PC29B_TC1_TIOA5                        (1L)         /**< TC1 signal line function value: TIOA5 */
#define PORT_PC29B_TC1_TIOA5                       (1UL << 29)
#define PIN_PC24B_TC1_TIOB3                        (88L)        /**< TC1 signal: TIOB3 on PC24 mux B*/
#define MUX_PC24B_TC1_TIOB3                        (1L)         /**< TC1 signal line function value: TIOB3 */
#define PORT_PC24B_TC1_TIOB3                       (1UL << 24)
#define PIN_PC27B_TC1_TIOB4                        (91L)        /**< TC1 signal: TIOB4 on PC27 mux B*/
#define MUX_PC27B_TC1_TIOB4                        (1L)         /**< TC1 signal line function value: TIOB4 */
#define PORT_PC27B_TC1_TIOB4                       (1UL << 27)
#define PIN_PC30B_TC1_TIOB5                        (94L)        /**< TC1 signal: TIOB5 on PC30 mux B*/
#define MUX_PC30B_TC1_TIOB5                        (1L)         /**< TC1 signal line function value: TIOB5 */
#define PORT_PC30B_TC1_TIOB5                       (1UL << 30)
/* ========== PIO definition for TC2 peripheral ========== */
#define PIN_PC7B_TC2_TCLK6                         (71L)        /**< TC2 signal: TCLK6 on PC7 mux B*/
#define MUX_PC7B_TC2_TCLK6                         (1L)         /**< TC2 signal line function value: TCLK6 */
#define PORT_PC7B_TC2_TCLK6                        (1UL << 7)
#define PIN_PC10B_TC2_TCLK7                        (74L)        /**< TC2 signal: TCLK7 on PC10 mux B*/
#define MUX_PC10B_TC2_TCLK7                        (1L)         /**< TC2 signal line function value: TCLK7 */
#define PORT_PC10B_TC2_TCLK7                       (1UL << 10)
#define PIN_PC14B_TC2_TCLK8                        (78L)        /**< TC2 signal: TCLK8 on PC14 mux B*/
#define MUX_PC14B_TC2_TCLK8                        (1L)         /**< TC2 signal line function value: TCLK8 */
#define PORT_PC14B_TC2_TCLK8                       (1UL << 14)
#define PIN_PC5B_TC2_TIOA6                         (69L)        /**< TC2 signal: TIOA6 on PC5 mux B*/
#define MUX_PC5B_TC2_TIOA6                         (1L)         /**< TC2 signal line function value: TIOA6 */
#define PORT_PC5B_TC2_TIOA6                        (1UL << 5)
#define PIN_PC8B_TC2_TIOA7                         (72L)        /**< TC2 signal: TIOA7 on PC8 mux B*/
#define MUX_PC8B_TC2_TIOA7                         (1L)         /**< TC2 signal line function value: TIOA7 */
#define PORT_PC8B_TC2_TIOA7                        (1UL << 8)
#define PIN_PC11B_TC2_TIOA8                        (75L)        /**< TC2 signal: TIOA8 on PC11 mux B*/
#define MUX_PC11B_TC2_TIOA8                        (1L)         /**< TC2 signal line function value: TIOA8 */
#define PORT_PC11B_TC2_TIOA8                       (1UL << 11)
#define PIN_PC6B_TC2_TIOB6                         (70L)        /**< TC2 signal: TIOB6 on PC6 mux B*/
#define MUX_PC6B_TC2_TIOB6                         (1L)         /**< TC2 signal line function value: TIOB6 */
#define PORT_PC6B_TC2_TIOB6                        (1UL << 6)
#define PIN_PC9B_TC2_TIOB7                         (73L)        /**< TC2 signal: TIOB7 on PC9 mux B*/
#define MUX_PC9B_TC2_TIOB7                         (1L)         /**< TC2 signal line function value: TIOB7 */
#define PORT_PC9B_TC2_TIOB7                        (1UL << 9)
#define PIN_PC12B_TC2_TIOB8                        (76L)        /**< TC2 signal: TIOB8 on PC12 mux B*/
#define MUX_PC12B_TC2_TIOB8                        (1L)         /**< TC2 signal line function value: TIOB8 */
#define PORT_PC12B_TC2_TIOB8                       (1UL << 12)
/* ========== PIO definition for TC3 peripheral ========== */
#define PIN_PE2B_TC3_TCLK9                         (130L)       /**< TC3 signal: TCLK9 on PE2 mux B*/
#define MUX_PE2B_TC3_TCLK9                         (1L)         /**< TC3 signal line function value: TCLK9 */
#define PORT_PE2B_TC3_TCLK9                        (1UL << 2)
#define PIN_PE5B_TC3_TCLK10                        (133L)       /**< TC3 signal: TCLK10 on PE5 mux B*/
#define MUX_PE5B_TC3_TCLK10                        (1L)         /**< TC3 signal line function value: TCLK10 */
#define PORT_PE5B_TC3_TCLK10                       (1UL << 5)
#define PIN_PD24C_TC3_TCLK11                       (120L)       /**< TC3 signal: TCLK11 on PD24 mux C*/
#define MUX_PD24C_TC3_TCLK11                       (2L)         /**< TC3 signal line function value: TCLK11 */
#define PORT_PD24C_TC3_TCLK11                      (1UL << 24)
#define PIN_PE0B_TC3_TIOA9                         (128L)       /**< TC3 signal: TIOA9 on PE0 mux B*/
#define MUX_PE0B_TC3_TIOA9                         (1L)         /**< TC3 signal line function value: TIOA9 */
#define PORT_PE0B_TC3_TIOA9                        (1UL << 0)
#define PIN_PE3B_TC3_TIOA10                        (131L)       /**< TC3 signal: TIOA10 on PE3 mux B*/
#define MUX_PE3B_TC3_TIOA10                        (1L)         /**< TC3 signal line function value: TIOA10 */
#define PORT_PE3B_TC3_TIOA10                       (1UL << 3)
#define PIN_PD21C_TC3_TIOA11                       (117L)       /**< TC3 signal: TIOA11 on PD21 mux C*/
#define MUX_PD21C_TC3_TIOA11                       (2L)         /**< TC3 signal line function value: TIOA11 */
#define PORT_PD21C_TC3_TIOA11                      (1UL << 21)
#define PIN_PE1B_TC3_TIOB9                         (129L)       /**< TC3 signal: TIOB9 on PE1 mux B*/
#define MUX_PE1B_TC3_TIOB9                         (1L)         /**< TC3 signal line function value: TIOB9 */
#define PORT_PE1B_TC3_TIOB9                        (1UL << 1)
#define PIN_PE4B_TC3_TIOB10                        (132L)       /**< TC3 signal: TIOB10 on PE4 mux B*/
#define MUX_PE4B_TC3_TIOB10                        (1L)         /**< TC3 signal line function value: TIOB10 */
#define PORT_PE4B_TC3_TIOB10                       (1UL << 4)
#define PIN_PD22C_TC3_TIOB11                       (118L)       /**< TC3 signal: TIOB11 on PD22 mux C*/
#define MUX_PD22C_TC3_TIOB11                       (2L)         /**< TC3 signal line function value: TIOB11 */
#define PORT_PD22C_TC3_TIOB11                      (1UL << 22)
/* ========== PIO definition for TWI0 peripheral ========== */
#define PIN_PA4A_TWI0_TWCK0                        (4L)         /**< TWI0 signal: TWCK0 on PA4 mux A*/
#define MUX_PA4A_TWI0_TWCK0                        (0L)         /**< TWI0 signal line function value: TWCK0 */
#define PORT_PA4A_TWI0_TWCK0                       (1UL << 4)
#define PIN_PA3A_TWI0_TWD0                         (3L)         /**< TWI0 signal: TWD0 on PA3 mux A*/
#define MUX_PA3A_TWI0_TWD0                         (0L)         /**< TWI0 signal line function value: TWD0 */
#define PORT_PA3A_TWI0_TWD0                        (1UL << 3)
/* ========== PIO definition for TWI1 peripheral ========== */
#define PIN_PB5A_TWI1_TWCK1                        (37L)        /**< TWI1 signal: TWCK1 on PB5 mux A*/
#define MUX_PB5A_TWI1_TWCK1                        (0L)         /**< TWI1 signal line function value: TWCK1 */
#define PORT_PB5A_TWI1_TWCK1                       (1UL << 5)
#define PIN_PB4A_TWI1_TWD1                         (36L)        /**< TWI1 signal: TWD1 on PB4 mux A*/
#define MUX_PB4A_TWI1_TWD1                         (0L)         /**< TWI1 signal line function value: TWD1 */
#define PORT_PB4A_TWI1_TWD1                        (1UL << 4)
/* ========== PIO definition for TWI2 peripheral ========== */
#define PIN_PD28C_TWI2_TWCK2                       (124L)       /**< TWI2 signal: TWCK2 on PD28 mux C*/
#define MUX_PD28C_TWI2_TWCK2                       (2L)         /**< TWI2 signal line function value: TWCK2 */
#define PORT_PD28C_TWI2_TWCK2                      (1UL << 28)
#define PIN_PD27C_TWI2_TWD2                        (123L)       /**< TWI2 signal: TWD2 on PD27 mux C*/
#define MUX_PD27C_TWI2_TWD2                        (2L)         /**< TWI2 signal line function value: TWD2 */
#define PORT_PD27C_TWI2_TWD2                       (1UL << 27)
/* ========== PIO definition for UART0 peripheral ========== */
#define PIN_PA9A_UART0_URXD0                       (9L)         /**< UART0 signal: URXD0 on PA9 mux A*/
#define MUX_PA9A_UART0_URXD0                       (0L)         /**< UART0 signal line function value: URXD0 */
#define PORT_PA9A_UART0_URXD0                      (1UL << 9)
#define PIN_PA10A_UART0_UTXD0                      (10L)        /**< UART0 signal: UTXD0 on PA10 mux A*/
#define MUX_PA10A_UART0_UTXD0                      (0L)         /**< UART0 signal line function value: UTXD0 */
#define PORT_PA10A_UART0_UTXD0                     (1UL << 10)
/* ========== PIO definition for UART1 peripheral ========== */
#define PIN_PA5C_UART1_URXD1                       (5L)         /**< UART1 signal: URXD1 on PA5 mux C*/
#define MUX_PA5C_UART1_URXD1                       (2L)         /**< UART1 signal line function value: URXD1 */
#define PORT_PA5C_UART1_URXD1                      (1UL << 5)
#define PIN_PA4C_UART1_UTXD1                       (4L)         /**< UART1 signal: UTXD1 on PA4 mux C*/
#define MUX_PA4C_UART1_UTXD1                       (2L)         /**< UART1 signal line function value: UTXD1 */
#define PORT_PA4C_UART1_UTXD1                      (1UL << 4)
#define PIN_PA6C_UART1_UTXD1                       (6L)         /**< UART1 signal: UTXD1 on PA6 mux C*/
#define MUX_PA6C_UART1_UTXD1                       (2L)         /**< UART1 signal line function value: UTXD1 */
#define PORT_PA6C_UART1_UTXD1                      (1UL << 6)
#define PIN_PD26D_UART1_UTXD1                      (122L)       /**< UART1 signal: UTXD1 on PD26 mux D*/
#define MUX_PD26D_UART1_UTXD1                      (3L)         /**< UART1 signal line function value: UTXD1 */
#define PORT_PD26D_UART1_UTXD1                     (1UL << 26)
/* ========== PIO definition for UART2 peripheral ========== */
#define PIN_PD25C_UART2_URXD2                      (121L)       /**< UART2 signal: URXD2 on PD25 mux C*/
#define MUX_PD25C_UART2_URXD2                      (2L)         /**< UART2 signal line function value: URXD2 */
#define PORT_PD25C_UART2_URXD2                     (1UL << 25)
#define PIN_PD26C_UART2_UTXD2                      (122L)       /**< UART2 signal: UTXD2 on PD26 mux C*/
#define MUX_PD26C_UART2_UTXD2                      (2L)         /**< UART2 signal line function value: UTXD2 */
#define PORT_PD26C_UART2_UTXD2                     (1UL << 26)
/* ========== PIO definition for UART3 peripheral ========== */
#define PIN_PD28A_UART3_URXD3                      (124L)       /**< UART3 signal: URXD3 on PD28 mux A*/
#define MUX_PD28A_UART3_URXD3                      (0L)         /**< UART3 signal line function value: URXD3 */
#define PORT_PD28A_UART3_URXD3                     (1UL << 28)
#define PIN_PD30A_UART3_UTXD3                      (126L)       /**< UART3 signal: UTXD3 on PD30 mux A*/
#define MUX_PD30A_UART3_UTXD3                      (0L)         /**< UART3 signal line function value: UTXD3 */
