zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/pio/pic32cz2038ca70144.h
#define PORT_PD30A_UART3_UTXD3                     (1UL << 30)
#define PIN_PD31B_UART3_UTXD3                      (127L)       /**< UART3 signal: UTXD3 on PD31 mux B*/
#define MUX_PD31B_UART3_UTXD3                      (1L)         /**< UART3 signal line function value: UTXD3 */
#define PORT_PD31B_UART3_UTXD3                     (1UL << 31)
/* ========== PIO definition for UART4 peripheral ========== */
#define PIN_PD18C_UART4_URXD4                      (114L)       /**< UART4 signal: URXD4 on PD18 mux C*/
#define MUX_PD18C_UART4_URXD4                      (2L)         /**< UART4 signal line function value: URXD4 */
#define PORT_PD18C_UART4_URXD4                     (1UL << 18)
#define PIN_PD3C_UART4_UTXD4                       (99L)        /**< UART4 signal: UTXD4 on PD3 mux C*/
#define MUX_PD3C_UART4_UTXD4                       (2L)         /**< UART4 signal line function value: UTXD4 */
#define PORT_PD3C_UART4_UTXD4                      (1UL << 3)
#define PIN_PD19C_UART4_UTXD4                      (115L)       /**< UART4 signal: UTXD4 on PD19 mux C*/
#define MUX_PD19C_UART4_UTXD4                      (2L)         /**< UART4 signal line function value: UTXD4 */
#define PORT_PD19C_UART4_UTXD4                     (1UL << 19)
/* ========== PIO definition for USART0 peripheral ========== */
#define PIN_PB2C_USART0_CTS0                       (34L)        /**< USART0 signal: CTS0 on PB2 mux C*/
#define MUX_PB2C_USART0_CTS0                       (2L)         /**< USART0 signal line function value: CTS0 */
#define PORT_PB2C_USART0_CTS0                      (1UL << 2)
#define PIN_PD0D_USART0_DCD0                       (96L)        /**< USART0 signal: DCD0 on PD0 mux D*/
#define MUX_PD0D_USART0_DCD0                       (3L)         /**< USART0 signal line function value: DCD0 */
#define PORT_PD0D_USART0_DCD0                      (1UL << 0)
#define PIN_PD2D_USART0_DSR0                       (98L)        /**< USART0 signal: DSR0 on PD2 mux D*/
#define MUX_PD2D_USART0_DSR0                       (3L)         /**< USART0 signal line function value: DSR0 */
#define PORT_PD2D_USART0_DSR0                      (1UL << 2)
#define PIN_PD1D_USART0_DTR0                       (97L)        /**< USART0 signal: DTR0 on PD1 mux D*/
#define MUX_PD1D_USART0_DTR0                       (3L)         /**< USART0 signal line function value: DTR0 */
#define PORT_PD1D_USART0_DTR0                      (1UL << 1)
#define PIN_PD3D_USART0_RI0                        (99L)        /**< USART0 signal: RI0 on PD3 mux D*/
#define MUX_PD3D_USART0_RI0                        (3L)         /**< USART0 signal line function value: RI0 */
#define PORT_PD3D_USART0_RI0                       (1UL << 3)
#define PIN_PB3C_USART0_RTS0                       (35L)        /**< USART0 signal: RTS0 on PB3 mux C*/
#define MUX_PB3C_USART0_RTS0                       (2L)         /**< USART0 signal line function value: RTS0 */
#define PORT_PB3C_USART0_RTS0                      (1UL << 3)
#define PIN_PB0C_USART0_RXD0                       (32L)        /**< USART0 signal: RXD0 on PB0 mux C*/
#define MUX_PB0C_USART0_RXD0                       (2L)         /**< USART0 signal line function value: RXD0 */
#define PORT_PB0C_USART0_RXD0                      (1UL << 0)
#define PIN_PB13C_USART0_SCK0                      (45L)        /**< USART0 signal: SCK0 on PB13 mux C*/
#define MUX_PB13C_USART0_SCK0                      (2L)         /**< USART0 signal line function value: SCK0 */
#define PORT_PB13C_USART0_SCK0                     (1UL << 13)
#define PIN_PB1C_USART0_TXD0                       (33L)        /**< USART0 signal: TXD0 on PB1 mux C*/
#define MUX_PB1C_USART0_TXD0                       (2L)         /**< USART0 signal line function value: TXD0 */
#define PORT_PB1C_USART0_TXD0                      (1UL << 1)
/* ========== PIO definition for USART1 peripheral ========== */
#define PIN_PA25A_USART1_CTS1                      (25L)        /**< USART1 signal: CTS1 on PA25 mux A*/
#define MUX_PA25A_USART1_CTS1                      (0L)         /**< USART1 signal line function value: CTS1 */
#define PORT_PA25A_USART1_CTS1                     (1UL << 25)
#define PIN_PA26A_USART1_DCD1                      (26L)        /**< USART1 signal: DCD1 on PA26 mux A*/
#define MUX_PA26A_USART1_DCD1                      (0L)         /**< USART1 signal line function value: DCD1 */
#define PORT_PA26A_USART1_DCD1                     (1UL << 26)
#define PIN_PA28A_USART1_DSR1                      (28L)        /**< USART1 signal: DSR1 on PA28 mux A*/
#define MUX_PA28A_USART1_DSR1                      (0L)         /**< USART1 signal line function value: DSR1 */
#define PORT_PA28A_USART1_DSR1                     (1UL << 28)
#define PIN_PA27A_USART1_DTR1                      (27L)        /**< USART1 signal: DTR1 on PA27 mux A*/
#define MUX_PA27A_USART1_DTR1                      (0L)         /**< USART1 signal line function value: DTR1 */
#define PORT_PA27A_USART1_DTR1                     (1UL << 27)
#define PIN_PA3B_USART1_LONCOL1                    (3L)         /**< USART1 signal: LONCOL1 on PA3 mux B*/
#define MUX_PA3B_USART1_LONCOL1                    (1L)         /**< USART1 signal line function value: LONCOL1 */
#define PORT_PA3B_USART1_LONCOL1                   (1UL << 3)
#define PIN_PA29A_USART1_RI1                       (29L)        /**< USART1 signal: RI1 on PA29 mux A*/
#define MUX_PA29A_USART1_RI1                       (0L)         /**< USART1 signal line function value: RI1 */
#define PORT_PA29A_USART1_RI1                      (1UL << 29)
#define PIN_PA24A_USART1_RTS1                      (24L)        /**< USART1 signal: RTS1 on PA24 mux A*/
#define MUX_PA24A_USART1_RTS1                      (0L)         /**< USART1 signal line function value: RTS1 */
#define PORT_PA24A_USART1_RTS1                     (1UL << 24)
#define PIN_PA21A_USART1_RXD1                      (21L)        /**< USART1 signal: RXD1 on PA21 mux A*/
#define MUX_PA21A_USART1_RXD1                      (0L)         /**< USART1 signal line function value: RXD1 */
#define PORT_PA21A_USART1_RXD1                     (1UL << 21)
#define PIN_PA23A_USART1_SCK1                      (23L)        /**< USART1 signal: SCK1 on PA23 mux A*/
#define MUX_PA23A_USART1_SCK1                      (0L)         /**< USART1 signal line function value: SCK1 */
#define PORT_PA23A_USART1_SCK1                     (1UL << 23)
#define PIN_PB4D_USART1_TXD1                       (36L)        /**< USART1 signal: TXD1 on PB4 mux D*/
#define MUX_PB4D_USART1_TXD1                       (3L)         /**< USART1 signal line function value: TXD1 */
#define PORT_PB4D_USART1_TXD1                      (1UL << 4)
/* ========== PIO definition for USART2 peripheral ========== */
#define PIN_PD19B_USART2_CTS2                      (115L)       /**< USART2 signal: CTS2 on PD19 mux B*/
#define MUX_PD19B_USART2_CTS2                      (1L)         /**< USART2 signal line function value: CTS2 */
#define PORT_PD19B_USART2_CTS2                     (1UL << 19)
#define PIN_PD4D_USART2_DCD2                       (100L)       /**< USART2 signal: DCD2 on PD4 mux D*/
#define MUX_PD4D_USART2_DCD2                       (3L)         /**< USART2 signal line function value: DCD2 */
#define PORT_PD4D_USART2_DCD2                      (1UL << 4)
#define PIN_PD6D_USART2_DSR2                       (102L)       /**< USART2 signal: DSR2 on PD6 mux D*/
#define MUX_PD6D_USART2_DSR2                       (3L)         /**< USART2 signal line function value: DSR2 */
#define PORT_PD6D_USART2_DSR2                      (1UL << 6)
#define PIN_PD5D_USART2_DTR2                       (101L)       /**< USART2 signal: DTR2 on PD5 mux D*/
#define MUX_PD5D_USART2_DTR2                       (3L)         /**< USART2 signal line function value: DTR2 */
#define PORT_PD5D_USART2_DTR2                      (1UL << 5)
#define PIN_PD7D_USART2_RI2                        (103L)       /**< USART2 signal: RI2 on PD7 mux D*/
#define MUX_PD7D_USART2_RI2                        (3L)         /**< USART2 signal line function value: RI2 */
#define PORT_PD7D_USART2_RI2                       (1UL << 7)
#define PIN_PD18B_USART2_RTS2                      (114L)       /**< USART2 signal: RTS2 on PD18 mux B*/
#define MUX_PD18B_USART2_RTS2                      (1L)         /**< USART2 signal line function value: RTS2 */
#define PORT_PD18B_USART2_RTS2                     (1UL << 18)
#define PIN_PD15B_USART2_RXD2                      (111L)       /**< USART2 signal: RXD2 on PD15 mux B*/
#define MUX_PD15B_USART2_RXD2                      (1L)         /**< USART2 signal line function value: RXD2 */
#define PORT_PD15B_USART2_RXD2                     (1UL << 15)
#define PIN_PD17B_USART2_SCK2                      (113L)       /**< USART2 signal: SCK2 on PD17 mux B*/
#define MUX_PD17B_USART2_SCK2                      (1L)         /**< USART2 signal line function value: SCK2 */
#define PORT_PD17B_USART2_SCK2                     (1UL << 17)
#define PIN_PD16B_USART2_TXD2                      (112L)       /**< USART2 signal: TXD2 on PD16 mux B*/
#define MUX_PD16B_USART2_TXD2                      (1L)         /**< USART2 signal line function value: TXD2 */
#define PORT_PD16B_USART2_TXD2                     (1UL << 16)
/* ========== PIO definition for EBI peripheral ========== */
#define PIN_PC18A_EBI_A0                           (82L)        /**< EBI signal: A0 on PC18 mux A*/
#define MUX_PC18A_EBI_A0                           (0L)         /**< EBI signal line function value: A0 */
#define PORT_PC18A_EBI_A0                          (1UL << 18)
#define PIN_PC18A_EBI_NBS0                         (82L)        /**< EBI signal: NBS0 on PC18 mux A*/
#define MUX_PC18A_EBI_NBS0                         (0L)         /**< EBI signal line function value: NBS0 */
#define PORT_PC18A_EBI_NBS0                        (1UL << 18)
#define PIN_PC18A_EBI_DQM0                         (82L)        /**< EBI signal: DQM0 on PC18 mux A*/
#define MUX_PC18A_EBI_DQM0                         (0L)         /**< EBI signal line function value: DQM0 */
#define PORT_PC18A_EBI_DQM0                        (1UL << 18)
#define PIN_PC19A_EBI_A1                           (83L)        /**< EBI signal: A1 on PC19 mux A*/
#define MUX_PC19A_EBI_A1                           (0L)         /**< EBI signal line function value: A1 */
#define PORT_PC19A_EBI_A1                          (1UL << 19)
#define PIN_PC20A_EBI_A2                           (84L)        /**< EBI signal: A2 on PC20 mux A*/
#define MUX_PC20A_EBI_A2                           (0L)         /**< EBI signal line function value: A2 */
#define PORT_PC20A_EBI_A2                          (1UL << 20)
#define PIN_PC20A_EBI_SDA0                         (84L)        /**< EBI signal: SDA0 on PC20 mux A*/
#define MUX_PC20A_EBI_SDA0                         (0L)         /**< EBI signal line function value: SDA0 */
#define PORT_PC20A_EBI_SDA0                        (1UL << 20)
#define PIN_PC21A_EBI_A3                           (85L)        /**< EBI signal: A3 on PC21 mux A*/
#define MUX_PC21A_EBI_A3                           (0L)         /**< EBI signal line function value: A3 */
#define PORT_PC21A_EBI_A3                          (1UL << 21)
#define PIN_PC21A_EBI_SDA1                         (85L)        /**< EBI signal: SDA1 on PC21 mux A*/
#define MUX_PC21A_EBI_SDA1                         (0L)         /**< EBI signal line function value: SDA1 */
#define PORT_PC21A_EBI_SDA1                        (1UL << 21)
#define PIN_PC22A_EBI_A4                           (86L)        /**< EBI signal: A4 on PC22 mux A*/
#define MUX_PC22A_EBI_A4                           (0L)         /**< EBI signal line function value: A4 */
#define PORT_PC22A_EBI_A4                          (1UL << 22)
#define PIN_PC22A_EBI_SDA2                         (86L)        /**< EBI signal: SDA2 on PC22 mux A*/
#define MUX_PC22A_EBI_SDA2                         (0L)         /**< EBI signal line function value: SDA2 */
#define PORT_PC22A_EBI_SDA2                        (1UL << 22)
#define PIN_PC23A_EBI_A5                           (87L)        /**< EBI signal: A5 on PC23 mux A*/
#define MUX_PC23A_EBI_A5                           (0L)         /**< EBI signal line function value: A5 */
#define PORT_PC23A_EBI_A5                          (1UL << 23)
#define PIN_PC23A_EBI_SDA3                         (87L)        /**< EBI signal: SDA3 on PC23 mux A*/
#define MUX_PC23A_EBI_SDA3                         (0L)         /**< EBI signal line function value: SDA3 */
#define PORT_PC23A_EBI_SDA3                        (1UL << 23)
#define PIN_PC24A_EBI_A6                           (88L)        /**< EBI signal: A6 on PC24 mux A*/
#define MUX_PC24A_EBI_A6                           (0L)         /**< EBI signal line function value: A6 */
#define PORT_PC24A_EBI_A6                          (1UL << 24)
#define PIN_PC24A_EBI_SDA4                         (88L)        /**< EBI signal: SDA4 on PC24 mux A*/
#define MUX_PC24A_EBI_SDA4                         (0L)         /**< EBI signal line function value: SDA4 */
#define PORT_PC24A_EBI_SDA4                        (1UL << 24)
#define PIN_PC25A_EBI_A7                           (89L)        /**< EBI signal: A7 on PC25 mux A*/
#define MUX_PC25A_EBI_A7                           (0L)         /**< EBI signal line function value: A7 */
#define PORT_PC25A_EBI_A7                          (1UL << 25)
#define PIN_PC25A_EBI_SDA5                         (89L)        /**< EBI signal: SDA5 on PC25 mux A*/
#define MUX_PC25A_EBI_SDA5                         (0L)         /**< EBI signal line function value: SDA5 */
#define PORT_PC25A_EBI_SDA5                        (1UL << 25)
#define PIN_PC26A_EBI_A8                           (90L)        /**< EBI signal: A8 on PC26 mux A*/
#define MUX_PC26A_EBI_A8                           (0L)         /**< EBI signal line function value: A8 */
#define PORT_PC26A_EBI_A8                          (1UL << 26)
#define PIN_PC26A_EBI_SDA6                         (90L)        /**< EBI signal: SDA6 on PC26 mux A*/
#define MUX_PC26A_EBI_SDA6                         (0L)         /**< EBI signal line function value: SDA6 */
#define PORT_PC26A_EBI_SDA6                        (1UL << 26)
#define PIN_PC27A_EBI_A9                           (91L)        /**< EBI signal: A9 on PC27 mux A*/
#define MUX_PC27A_EBI_A9                           (0L)         /**< EBI signal line function value: A9 */
#define PORT_PC27A_EBI_A9                          (1UL << 27)
#define PIN_PC27A_EBI_SDA7                         (91L)        /**< EBI signal: SDA7 on PC27 mux A*/
#define MUX_PC27A_EBI_SDA7                         (0L)         /**< EBI signal line function value: SDA7 */
#define PORT_PC27A_EBI_SDA7                        (1UL << 27)
#define PIN_PC28A_EBI_A10                          (92L)        /**< EBI signal: A10 on PC28 mux A*/
#define MUX_PC28A_EBI_A10                          (0L)         /**< EBI signal line function value: A10 */
#define PORT_PC28A_EBI_A10                         (1UL << 28)
#define PIN_PC28A_EBI_SDA8                         (92L)        /**< EBI signal: SDA8 on PC28 mux A*/
#define MUX_PC28A_EBI_SDA8                         (0L)         /**< EBI signal line function value: SDA8 */
#define PORT_PC28A_EBI_SDA8                        (1UL << 28)
#define PIN_PC29A_EBI_A11                          (93L)        /**< EBI signal: A11 on PC29 mux A*/
#define MUX_PC29A_EBI_A11                          (0L)         /**< EBI signal line function value: A11 */
#define PORT_PC29A_EBI_A11                         (1UL << 29)
#define PIN_PC29A_EBI_SDA9                         (93L)        /**< EBI signal: SDA9 on PC29 mux A*/
#define MUX_PC29A_EBI_SDA9                         (0L)         /**< EBI signal line function value: SDA9 */
#define PORT_PC29A_EBI_SDA9                        (1UL << 29)
#define PIN_PC30A_EBI_A12                          (94L)        /**< EBI signal: A12 on PC30 mux A*/
#define MUX_PC30A_EBI_A12                          (0L)         /**< EBI signal line function value: A12 */
#define PORT_PC30A_EBI_A12                         (1UL << 30)
#define PIN_PC31A_EBI_A13                          (95L)        /**< EBI signal: A13 on PC31 mux A*/
#define MUX_PC31A_EBI_A13                          (0L)         /**< EBI signal line function value: A13 */
#define PORT_PC31A_EBI_A13                         (1UL << 31)
#define PIN_PC31A_EBI_SDA11                        (95L)        /**< EBI signal: SDA11 on PC31 mux A*/
#define MUX_PC31A_EBI_SDA11                        (0L)         /**< EBI signal line function value: SDA11 */
#define PORT_PC31A_EBI_SDA11                       (1UL << 31)
#define PIN_PA18C_EBI_A14                          (18L)        /**< EBI signal: A14 on PA18 mux C*/
#define MUX_PA18C_EBI_A14                          (2L)         /**< EBI signal line function value: A14 */
#define PORT_PA18C_EBI_A14                         (1UL << 18)
#define PIN_PA18C_EBI_SDA12                        (18L)        /**< EBI signal: SDA12 on PA18 mux C*/
#define MUX_PA18C_EBI_SDA12                        (2L)         /**< EBI signal line function value: SDA12 */
#define PORT_PA18C_EBI_SDA12                       (1UL << 18)
#define PIN_PA19C_EBI_A15                          (19L)        /**< EBI signal: A15 on PA19 mux C*/
#define MUX_PA19C_EBI_A15                          (2L)         /**< EBI signal line function value: A15 */
#define PORT_PA19C_EBI_A15                         (1UL << 19)
#define PIN_PA19C_EBI_SDA13                        (19L)        /**< EBI signal: SDA13 on PA19 mux C*/
#define MUX_PA19C_EBI_SDA13                        (2L)         /**< EBI signal line function value: SDA13 */
#define PORT_PA19C_EBI_SDA13                       (1UL << 19)
#define PIN_PA20C_EBI_A16                          (20L)        /**< EBI signal: A16 on PA20 mux C*/
#define MUX_PA20C_EBI_A16                          (2L)         /**< EBI signal line function value: A16 */
#define PORT_PA20C_EBI_A16                         (1UL << 20)
#define PIN_PA20C_EBI_BA0                          (20L)        /**< EBI signal: BA0 on PA20 mux C*/
#define MUX_PA20C_EBI_BA0                          (2L)         /**< EBI signal line function value: BA0 */
#define PORT_PA20C_EBI_BA0                         (1UL << 20)
#define PIN_PA0C_EBI_A17                           (0L)         /**< EBI signal: A17 on PA0 mux C*/
#define MUX_PA0C_EBI_A17                           (2L)         /**< EBI signal line function value: A17 */
#define PORT_PA0C_EBI_A17                          (1UL << 0)
#define PIN_PA0C_EBI_BA1                           (0L)         /**< EBI signal: BA1 on PA0 mux C*/
#define MUX_PA0C_EBI_BA1                           (2L)         /**< EBI signal line function value: BA1 */
#define PORT_PA0C_EBI_BA1                          (1UL << 0)
#define PIN_PA1C_EBI_A18                           (1L)         /**< EBI signal: A18 on PA1 mux C*/
#define MUX_PA1C_EBI_A18                           (2L)         /**< EBI signal line function value: A18 */
#define PORT_PA1C_EBI_A18                          (1UL << 1)
#define PIN_PA23C_EBI_A19                          (23L)        /**< EBI signal: A19 on PA23 mux C*/
#define MUX_PA23C_EBI_A19                          (2L)         /**< EBI signal line function value: A19 */
#define PORT_PA23C_EBI_A19                         (1UL << 23)
#define PIN_PA24C_EBI_A20                          (24L)        /**< EBI signal: A20 on PA24 mux C*/
#define MUX_PA24C_EBI_A20                          (2L)         /**< EBI signal line function value: A20 */
#define PORT_PA24C_EBI_A20                         (1UL << 24)
#define PIN_PC16A_EBI_A21                          (80L)        /**< EBI signal: A21 on PC16 mux A*/
#define MUX_PC16A_EBI_A21                          (0L)         /**< EBI signal line function value: A21 */
#define PORT_PC16A_EBI_A21                         (1UL << 16)
#define PIN_PC16A_EBI_NANDALE                      (80L)        /**< EBI signal: NANDALE on PC16 mux A*/
#define MUX_PC16A_EBI_NANDALE                      (0L)         /**< EBI signal line function value: NANDALE */
#define PORT_PC16A_EBI_NANDALE                     (1UL << 16)
#define PIN_PC17A_EBI_A22                          (81L)        /**< EBI signal: A22 on PC17 mux A*/
#define MUX_PC17A_EBI_A22                          (0L)         /**< EBI signal line function value: A22 */
#define PORT_PC17A_EBI_A22                         (1UL << 17)
#define PIN_PC17A_EBI_NANDCLE                      (81L)        /**< EBI signal: NANDCLE on PC17 mux A*/
#define MUX_PC17A_EBI_NANDCLE                      (0L)         /**< EBI signal line function value: NANDCLE */
#define PORT_PC17A_EBI_NANDCLE                     (1UL << 17)
#define PIN_PA25C_EBI_A23                          (25L)        /**< EBI signal: A23 on PA25 mux C*/
#define MUX_PA25C_EBI_A23                          (2L)         /**< EBI signal line function value: A23 */
#define PORT_PA25C_EBI_A23                         (1UL << 25)
#define PIN_PD17C_EBI_CAS                          (113L)       /**< EBI signal: CAS on PD17 mux C*/
#define MUX_PD17C_EBI_CAS                          (2L)         /**< EBI signal line function value: CAS */
#define PORT_PD17C_EBI_CAS                         (1UL << 17)
#define PIN_PC0A_EBI_D0                            (64L)        /**< EBI signal: D0 on PC0 mux A*/
#define MUX_PC0A_EBI_D0                            (0L)         /**< EBI signal line function value: D0 */
#define PORT_PC0A_EBI_D0                           (1UL << 0)
#define PIN_PC1A_EBI_D1                            (65L)        /**< EBI signal: D1 on PC1 mux A*/
#define MUX_PC1A_EBI_D1                            (0L)         /**< EBI signal line function value: D1 */
#define PORT_PC1A_EBI_D1                           (1UL << 1)
#define PIN_PC2A_EBI_D2                            (66L)        /**< EBI signal: D2 on PC2 mux A*/
#define MUX_PC2A_EBI_D2                            (0L)         /**< EBI signal line function value: D2 */
#define PORT_PC2A_EBI_D2                           (1UL << 2)
#define PIN_PC3A_EBI_D3                            (67L)        /**< EBI signal: D3 on PC3 mux A*/
#define MUX_PC3A_EBI_D3                            (0L)         /**< EBI signal line function value: D3 */
#define PORT_PC3A_EBI_D3                           (1UL << 3)
#define PIN_PC4A_EBI_D4                            (68L)        /**< EBI signal: D4 on PC4 mux A*/
#define MUX_PC4A_EBI_D4                            (0L)         /**< EBI signal line function value: D4 */
#define PORT_PC4A_EBI_D4                           (1UL << 4)
#define PIN_PC5A_EBI_D5                            (69L)        /**< EBI signal: D5 on PC5 mux A*/
#define MUX_PC5A_EBI_D5                            (0L)         /**< EBI signal line function value: D5 */
#define PORT_PC5A_EBI_D5                           (1UL << 5)
#define PIN_PC6A_EBI_D6                            (70L)        /**< EBI signal: D6 on PC6 mux A*/
#define MUX_PC6A_EBI_D6                            (0L)         /**< EBI signal line function value: D6 */
#define PORT_PC6A_EBI_D6                           (1UL << 6)
#define PIN_PC7A_EBI_D7                            (71L)        /**< EBI signal: D7 on PC7 mux A*/
#define MUX_PC7A_EBI_D7                            (0L)         /**< EBI signal line function value: D7 */
#define PORT_PC7A_EBI_D7                           (1UL << 7)
#define PIN_PE0A_EBI_D8                            (128L)       /**< EBI signal: D8 on PE0 mux A*/
#define MUX_PE0A_EBI_D8                            (0L)         /**< EBI signal line function value: D8 */
#define PORT_PE0A_EBI_D8                           (1UL << 0)
