zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/pio/pic32cz2038ca70144.h
#define PIN_PE1A_EBI_D9                            (129L)       /**< EBI signal: D9 on PE1 mux A*/
#define MUX_PE1A_EBI_D9                            (0L)         /**< EBI signal line function value: D9 */
#define PORT_PE1A_EBI_D9                           (1UL << 1)
#define PIN_PE2A_EBI_D10                           (130L)       /**< EBI signal: D10 on PE2 mux A*/
#define MUX_PE2A_EBI_D10                           (0L)         /**< EBI signal line function value: D10 */
#define PORT_PE2A_EBI_D10                          (1UL << 2)
#define PIN_PE3A_EBI_D11                           (131L)       /**< EBI signal: D11 on PE3 mux A*/
#define MUX_PE3A_EBI_D11                           (0L)         /**< EBI signal line function value: D11 */
#define PORT_PE3A_EBI_D11                          (1UL << 3)
#define PIN_PE4A_EBI_D12                           (132L)       /**< EBI signal: D12 on PE4 mux A*/
#define MUX_PE4A_EBI_D12                           (0L)         /**< EBI signal line function value: D12 */
#define PORT_PE4A_EBI_D12                          (1UL << 4)
#define PIN_PE5A_EBI_D13                           (133L)       /**< EBI signal: D13 on PE5 mux A*/
#define MUX_PE5A_EBI_D13                           (0L)         /**< EBI signal line function value: D13 */
#define PORT_PE5A_EBI_D13                          (1UL << 5)
#define PIN_PA15A_EBI_D14                          (15L)        /**< EBI signal: D14 on PA15 mux A*/
#define MUX_PA15A_EBI_D14                          (0L)         /**< EBI signal line function value: D14 */
#define PORT_PA15A_EBI_D14                         (1UL << 15)
#define PIN_PA16A_EBI_D15                          (16L)        /**< EBI signal: D15 on PA16 mux A*/
#define MUX_PA16A_EBI_D15                          (0L)         /**< EBI signal line function value: D15 */
#define PORT_PA16A_EBI_D15                         (1UL << 16)
#define PIN_PC9A_EBI_NANDOE                        (73L)        /**< EBI signal: NANDOE on PC9 mux A*/
#define MUX_PC9A_EBI_NANDOE                        (0L)         /**< EBI signal line function value: NANDOE */
#define PORT_PC9A_EBI_NANDOE                       (1UL << 9)
#define PIN_PC10A_EBI_NANDWE                       (74L)        /**< EBI signal: NANDWE on PC10 mux A*/
#define MUX_PC10A_EBI_NANDWE                       (0L)         /**< EBI signal line function value: NANDWE */
#define PORT_PC10A_EBI_NANDWE                      (1UL << 10)
#define PIN_PC14A_EBI_NCS0                         (78L)        /**< EBI signal: NCS0 on PC14 mux A*/
#define MUX_PC14A_EBI_NCS0                         (0L)         /**< EBI signal line function value: NCS0 */
#define PORT_PC14A_EBI_NCS0                        (1UL << 14)
#define PIN_PC15A_EBI_NCS1                         (79L)        /**< EBI signal: NCS1 on PC15 mux A*/
#define MUX_PC15A_EBI_NCS1                         (0L)         /**< EBI signal line function value: NCS1 */
#define PORT_PC15A_EBI_NCS1                        (1UL << 15)
#define PIN_PC15A_EBI_SDCS                         (79L)        /**< EBI signal: SDCS on PC15 mux A*/
#define MUX_PC15A_EBI_SDCS                         (0L)         /**< EBI signal line function value: SDCS */
#define PORT_PC15A_EBI_SDCS                        (1UL << 15)
#define PIN_PD18A_EBI_NCS1                         (114L)       /**< EBI signal: NCS1 on PD18 mux A*/
#define MUX_PD18A_EBI_NCS1                         (0L)         /**< EBI signal line function value: NCS1 */
#define PORT_PD18A_EBI_NCS1                        (1UL << 18)
#define PIN_PD18A_EBI_SDCS                         (114L)       /**< EBI signal: SDCS on PD18 mux A*/
#define MUX_PD18A_EBI_SDCS                         (0L)         /**< EBI signal line function value: SDCS */
#define PORT_PD18A_EBI_SDCS                        (1UL << 18)
#define PIN_PA22C_EBI_NCS2                         (22L)        /**< EBI signal: NCS2 on PA22 mux C*/
#define MUX_PA22C_EBI_NCS2                         (2L)         /**< EBI signal line function value: NCS2 */
#define PORT_PA22C_EBI_NCS2                        (1UL << 22)
#define PIN_PC12A_EBI_NCS3                         (76L)        /**< EBI signal: NCS3 on PC12 mux A*/
#define MUX_PC12A_EBI_NCS3                         (0L)         /**< EBI signal line function value: NCS3 */
#define PORT_PC12A_EBI_NCS3                        (1UL << 12)
#define PIN_PD19A_EBI_NCS3                         (115L)       /**< EBI signal: NCS3 on PD19 mux A*/
#define MUX_PD19A_EBI_NCS3                         (0L)         /**< EBI signal line function value: NCS3 */
#define PORT_PD19A_EBI_NCS3                        (1UL << 19)
#define PIN_PC11A_EBI_NRD                          (75L)        /**< EBI signal: NRD on PC11 mux A*/
#define MUX_PC11A_EBI_NRD                          (0L)         /**< EBI signal line function value: NRD */
#define PORT_PC11A_EBI_NRD                         (1UL << 11)
#define PIN_PC13A_EBI_NWAIT                        (77L)        /**< EBI signal: NWAIT on PC13 mux A*/
#define MUX_PC13A_EBI_NWAIT                        (0L)         /**< EBI signal line function value: NWAIT */
#define PORT_PC13A_EBI_NWAIT                       (1UL << 13)
#define PIN_PC8A_EBI_NWR0                          (72L)        /**< EBI signal: NWR0 on PC8 mux A*/
#define MUX_PC8A_EBI_NWR0                          (0L)         /**< EBI signal line function value: NWR0 */
#define PORT_PC8A_EBI_NWR0                         (1UL << 8)
#define PIN_PC8A_EBI_NWE                           (72L)        /**< EBI signal: NWE on PC8 mux A*/
#define MUX_PC8A_EBI_NWE                           (0L)         /**< EBI signal line function value: NWE */
#define PORT_PC8A_EBI_NWE                          (1UL << 8)
#define PIN_PD15C_EBI_NWR1                         (111L)       /**< EBI signal: NWR1 on PD15 mux C*/
#define MUX_PD15C_EBI_NWR1                         (2L)         /**< EBI signal line function value: NWR1 */
#define PORT_PD15C_EBI_NWR1                        (1UL << 15)
#define PIN_PD15C_EBI_NBS1                         (111L)       /**< EBI signal: NBS1 on PD15 mux C*/
#define MUX_PD15C_EBI_NBS1                         (2L)         /**< EBI signal line function value: NBS1 */
#define PORT_PD15C_EBI_NBS1                        (1UL << 15)
#define PIN_PD15C_EBI_DQM1                         (111L)       /**< EBI signal: DQM1 on PD15 mux C*/
#define MUX_PD15C_EBI_DQM1                         (2L)         /**< EBI signal line function value: DQM1 */
#define PORT_PD15C_EBI_DQM1                        (1UL << 15)
#define PIN_PD16C_EBI_RAS                          (112L)       /**< EBI signal: RAS on PD16 mux C*/
#define MUX_PD16C_EBI_RAS                          (2L)         /**< EBI signal line function value: RAS */
#define PORT_PD16C_EBI_RAS                         (1UL << 16)
#define PIN_PC13C_EBI_SDA10                        (77L)        /**< EBI signal: SDA10 on PC13 mux C*/
#define MUX_PC13C_EBI_SDA10                        (2L)         /**< EBI signal line function value: SDA10 */
#define PORT_PC13C_EBI_SDA10                       (1UL << 13)
#define PIN_PD13C_EBI_SDA10                        (109L)       /**< EBI signal: SDA10 on PD13 mux C*/
#define MUX_PD13C_EBI_SDA10                        (2L)         /**< EBI signal line function value: SDA10 */
#define PORT_PD13C_EBI_SDA10                       (1UL << 13)
#define PIN_PD23C_EBI_SDCK                         (119L)       /**< EBI signal: SDCK on PD23 mux C*/
#define MUX_PD23C_EBI_SDCK                         (2L)         /**< EBI signal line function value: SDCK */
#define PORT_PD23C_EBI_SDCK                        (1UL << 23)
#define PIN_PD14C_EBI_SDCKE                        (110L)       /**< EBI signal: SDCKE on PD14 mux C*/
#define MUX_PD14C_EBI_SDCKE                        (2L)         /**< EBI signal line function value: SDCKE */
#define PORT_PD14C_EBI_SDCKE                       (1UL << 14)
#define PIN_PD29C_EBI_SDWE                         (125L)       /**< EBI signal: SDWE on PD29 mux C*/
#define MUX_PD29C_EBI_SDWE                         (2L)         /**< EBI signal line function value: SDWE */
#define PORT_PD29C_EBI_SDWE                        (1UL << 29)
/* ========== PIO definition for OSCILLATOR peripheral ========== */
#define PIN_PB9X1_OSCILLATOR_XIN                   (41L)        /**< OSCILLATOR signal: XIN on PB9 mux X1*/
#define PORT_PB9X1_OSCILLATOR_XIN                  (1UL << 9)
#define PIN_PB8X1_OSCILLATOR_XOUT                  (40L)        /**< OSCILLATOR signal: XOUT on PB8 mux X1*/
#define PORT_PB8X1_OSCILLATOR_XOUT                 (1UL << 8)
#define PIN_PA7X1_OSCILLATOR_XIN32                 (7L)         /**< OSCILLATOR signal: XIN32 on PA7 mux X1*/
#define PORT_PA7X1_OSCILLATOR_XIN32                (1UL << 7)
#define PIN_PA8X1_OSCILLATOR_XOUT32                (8L)         /**< OSCILLATOR signal: XOUT32 on PA8 mux X1*/
#define PORT_PA8X1_OSCILLATOR_XOUT32               (1UL << 8)
/* ========== PIO definition for PORT peripheral ========== */
#define PIN_PA3X1_PORT_PORTDC0                     (3L)         /**< PORT signal: PORTDC0 on PA3 mux X1*/
#define PORT_PA3X1_PORT_PORTDC0                    (1UL << 3)
#define PIN_PA4X1_PORT_PORTDC1                     (4L)         /**< PORT signal: PORTDC1 on PA4 mux X1*/
#define PORT_PA4X1_PORT_PORTDC1                    (1UL << 4)
#define PIN_PA5X1_PORT_PORTDC2                     (5L)         /**< PORT signal: PORTDC2 on PA5 mux X1*/
#define PORT_PA5X1_PORT_PORTDC2                    (1UL << 5)
#define PIN_PA9X1_PORT_PORTDC3                     (9L)         /**< PORT signal: PORTDC3 on PA9 mux X1*/
#define PORT_PA9X1_PORT_PORTDC3                    (1UL << 9)
#define PIN_PA10X1_PORT_PORTDC4                    (10L)        /**< PORT signal: PORTDC4 on PA10 mux X1*/
#define PORT_PA10X1_PORT_PORTDC4                   (1UL << 10)
#define PIN_PA11X1_PORT_PORTDC5                    (11L)        /**< PORT signal: PORTDC5 on PA11 mux X1*/
#define PORT_PA11X1_PORT_PORTDC5                   (1UL << 11)
#define PIN_PA12X1_PORT_PORTDC6                    (12L)        /**< PORT signal: PORTDC6 on PA12 mux X1*/
#define PORT_PA12X1_PORT_PORTDC6                   (1UL << 12)
#define PIN_PA13X1_PORT_PORTDC7                    (13L)        /**< PORT signal: PORTDC7 on PA13 mux X1*/
#define PORT_PA13X1_PORT_PORTDC7                   (1UL << 13)
#define PIN_PA14X1_PORT_PORTDCEN1                  (14L)        /**< PORT signal: PORTDCEN1 on PA14 mux X1*/
#define PORT_PA14X1_PORT_PORTDCEN1                 (1UL << 14)
#define PIN_PA21X1_PORT_PORTDCEN2                  (21L)        /**< PORT signal: PORTDCEN2 on PA21 mux X1*/
#define PORT_PA21X1_PORT_PORTDCEN2                 (1UL << 21)
#define PIN_PA22X1_PORT_PORTDCCLK                  (22L)        /**< PORT signal: PORTDCCLK on PA22 mux X1*/
#define PORT_PA22X1_PORT_PORTDCCLK                 (1UL << 22)
/* ========== PIO definition for DEBUG peripheral ========== */
#define PIN_PB4X1_DEBUG_TDI                        (36L)        /**< DEBUG signal: TDI on PB4 mux X1*/
#define PORT_PB4X1_DEBUG_TDI                       (1UL << 4)
#define PIN_PB5X1_DEBUG_TDO                        (37L)        /**< DEBUG signal: TDO on PB5 mux X1*/
#define PORT_PB5X1_DEBUG_TDO                       (1UL << 5)
#define PIN_PB5X1_DEBUG_TRACESWO                   (37L)        /**< DEBUG signal: TRACESWO on PB5 mux X1*/
#define PORT_PB5X1_DEBUG_TRACESWO                  (1UL << 5)
#define PIN_PB6X1_DEBUG_TMS                        (38L)        /**< DEBUG signal: TMS on PB6 mux X1*/
#define PORT_PB6X1_DEBUG_TMS                       (1UL << 6)
#define PIN_PB6X1_DEBUG_SWDIO                      (38L)        /**< DEBUG signal: SWDIO on PB6 mux X1*/
#define PORT_PB6X1_DEBUG_SWDIO                     (1UL << 6)
#define PIN_PB7X1_DEBUG_TCK                        (39L)        /**< DEBUG signal: TCK on PB7 mux X1*/
#define PORT_PB7X1_DEBUG_TCK                       (1UL << 7)
#define PIN_PB7X1_DEBUG_SWDCLK                     (39L)        /**< DEBUG signal: SWDCLK on PB7 mux X1*/
#define PORT_PB7X1_DEBUG_SWDCLK                    (1UL << 7)
/* ========== PIO definition for FLASH peripheral ========== */
#define PIN_PB12X1_FLASH_ERASE                     (44L)        /**< FLASH signal: ERASE on PB12 mux X1*/
#define PORT_PB12X1_FLASH_ERASE                    (1UL << 12)
/* ========== PIO definition for TRACE peripheral ========== */
#define PIN_PD8D_TRACE_TRACECLK                    (104L)       /**< TRACE signal: TRACECLK on PD8 mux D*/
#define MUX_PD8D_TRACE_TRACECLK                    (3L)         /**< TRACE signal line function value: TRACECLK */
#define PORT_PD8D_TRACE_TRACECLK                   (1UL << 8)
#define PIN_PD4C_TRACE_TRACED0                     (100L)       /**< TRACE signal: TRACED0 on PD4 mux C*/
#define MUX_PD4C_TRACE_TRACED0                     (2L)         /**< TRACE signal line function value: TRACED0 */
#define PORT_PD4C_TRACE_TRACED0                    (1UL << 4)
#define PIN_PD5C_TRACE_TRACED1                     (101L)       /**< TRACE signal: TRACED1 on PD5 mux C*/
#define MUX_PD5C_TRACE_TRACED1                     (2L)         /**< TRACE signal line function value: TRACED1 */
#define PORT_PD5C_TRACE_TRACED1                    (1UL << 5)
#define PIN_PD6C_TRACE_TRACED2                     (102L)       /**< TRACE signal: TRACED2 on PD6 mux C*/
#define MUX_PD6C_TRACE_TRACED2                     (2L)         /**< TRACE signal line function value: TRACED2 */
#define PORT_PD6C_TRACE_TRACED2                    (1UL << 6)
#define PIN_PD7C_TRACE_TRACED3                     (103L)       /**< TRACE signal: TRACED3 on PD7 mux C*/
#define MUX_PD7C_TRACE_TRACED3                     (2L)         /**< TRACE signal line function value: TRACED3 */
#define PORT_PD7C_TRACE_TRACED3                    (1UL << 7)
/* ========== PIO definition for WKUP peripheral ========== */
#define PIN_PA0X1_WKUP_WKUP0                       (0L)         /**< WKUP signal: WKUP0 on PA0 mux X1*/
#define PORT_PA0X1_WKUP_WKUP0                      (1UL << 0)
#define PIN_PA1X1_WKUP_WKUP1                       (1L)         /**< WKUP signal: WKUP1 on PA1 mux X1*/
#define PORT_PA1X1_WKUP_WKUP1                      (1UL << 1)
#define PIN_PA2X1_WKUP_WKUP2                       (2L)         /**< WKUP signal: WKUP2 on PA2 mux X1*/
#define PORT_PA2X1_WKUP_WKUP2                      (1UL << 2)
#define PIN_PA4X1_WKUP_WKUP3                       (4L)         /**< WKUP signal: WKUP3 on PA4 mux X1*/
#define PORT_PA4X1_WKUP_WKUP3                      (1UL << 4)
#define PIN_PA5X1_WKUP_WKUP4                       (5L)         /**< WKUP signal: WKUP4 on PA5 mux X1*/
#define PORT_PA5X1_WKUP_WKUP4                      (1UL << 5)
#define PIN_PD28X1_WKUP_WKUP5                      (124L)       /**< WKUP signal: WKUP5 on PD28 mux X1*/
#define PORT_PD28X1_WKUP_WKUP5                     (1UL << 28)
#define PIN_PA9X1_WKUP_WKUP6                       (9L)         /**< WKUP signal: WKUP6 on PA9 mux X1*/
#define PORT_PA9X1_WKUP_WKUP6                      (1UL << 9)
#define PIN_PA11X1_WKUP_WKUP7                      (11L)        /**< WKUP signal: WKUP7 on PA11 mux X1*/
#define PORT_PA11X1_WKUP_WKUP7                     (1UL << 11)
#define PIN_PA14X1_WKUP_WKUP8                      (14L)        /**< WKUP signal: WKUP8 on PA14 mux X1*/
#define PORT_PA14X1_WKUP_WKUP8                     (1UL << 14)
#define PIN_PA19X1_WKUP_WKUP9                      (19L)        /**< WKUP signal: WKUP9 on PA19 mux X1*/
#define PORT_PA19X1_WKUP_WKUP9                     (1UL << 19)
#define PIN_PA20X1_WKUP_WKUP10                     (20L)        /**< WKUP signal: WKUP10 on PA20 mux X1*/
#define PORT_PA20X1_WKUP_WKUP10                    (1UL << 20)
#define PIN_PA30X1_WKUP_WKUP11                     (30L)        /**< WKUP signal: WKUP11 on PA30 mux X1*/
#define PORT_PA30X1_WKUP_WKUP11                    (1UL << 30)
#define PIN_PB3X1_WKUP_WKUP12                      (35L)        /**< WKUP signal: WKUP12 on PB3 mux X1*/
#define PORT_PB3X1_WKUP_WKUP12                     (1UL << 3)
#define PIN_PB5X1_WKUP_WKUP13                      (37L)        /**< WKUP signal: WKUP13 on PB5 mux X1*/
#define PORT_PB5X1_WKUP_WKUP13                     (1UL << 5)

#endif /* _PIC32CZ2038CA70144_GPIO_H_ */
